"""All prompts used for fact-checking subtasks prompting."""

CLAIM_EXTRACTION_PROMPT = {
    "system": "يرجى تقديم الادعاء الذي ترغب في التحقق من صحته.",
    "user": """تم إعطاؤك نصًا يحتوي على ادعاءات معرفية. الادعاء هو عبارة عن بيان يدّعي صحة شيء أو خطأه، ويمكن التحقق منه من قبل البشر. مهمتك هي تحديد واستخراج كل ادعاء مذكور في النص المقدم بدقة. ثم قم بحل أي مرجع ضمير (الضمائر أو التعبيرات الإشارية الأخرى) في الادعاء لتوضيحه. يجب أن يكون كل ادعاء موجزًا (أقل من 15 كلمة) ومكتفيًا بذاته.
يجب أن تكون استجابتك قائمة من القواميس. يجب أن يحتوي كل قاموس على المفتاح "claim"، الذي يتوافق مع الادعاء المستخرج (مع حل كل المراجع الضمائرية بوضوح).
يجب أن ترد فقط بالتنسيق الموضح أدناه. لا ترد بأي شيء آخر. إضافة أي ملاحظات إضافية تنتهك التنسيق المطلوب ممنوع. ابدأ استجابتك بـ '['.
[تنسيق الاستجابة]:
[
    {{
    "claim": "تأكد من أن الادعاء أقل من 15 كلمة وينقل فكرة كاملة. قم بحل أي مرجع ضمير (الضمائر أو التعبيرات الإشارية الأخرى) في الادعاء لتوضيحه",
    }},
    ...
]

إليك مثالان:
[النص]: توماس بيرديتش هزم جايل مونفيس 6-1، 6-4 يوم السبت. اللاعب المصنف السادس يصل إلى نهائي مونتي كارلو للأساتذة لأول مرة. بيرديتش سيواجه إما رافاييل نادال أو نوفاك ديوكوفيتش في النهائي.
[الاستجابة]: [{{"claim": "توماس بيرديتش هزم جايل مونفيس 6-1، 6-4"}}, {{"claim": "توماس بيرديتش هزم جايل مونفيس 6-1، 6-4 يوم السبت"}}, {{"claim": "توماس بيرديتش يصل إلى نهائي مونتي كارلو للأساتذة"}}, {{"claim": "توماس بيرديتش هو اللاعب المصنف السادس"}}, {{"claim": "توماس بيرديتش يصل إلى نهائي مونتي كارلو للأساتذة لأول مرة"}}, {{"claim": "بيرديتش سيواجه إما رافاييل نادال أو نوفاك ديوكوفيتش"}}, {{"claim": "بيرديتش سيواجه إما رافاييل نادال أو نوفاك ديوكوفيتش في النهائي"}}]

[النص]: تطبيق تيندر يعرض فقط آخر 34 صورة - ولكن يمكن للمستخدمين رؤية المزيد بسهولة. الشركة قالت أيضًا إنها حسّنت ميزتها الخاصة بالأصدقاء المشتركين.
[الاستجابة]: [{{"claim": "تطبيق تيندر يعرض فقط آخر الصور"}}, {{"claim": "تطبيق تيندر يعرض فقط آخر 34 صورة"}}, {{"claim": "يمكن لمستخدمي تيندر رؤية المزيد من الصور بسهولة"}}, {{"claim": "الشركة قالت إنها حسّنت ميزتها"}}, {{"claim": "الشركة قالت إنها حسّنت ميزتها الخاصة بالأصدقاء المشتركين"}}]

الآن أكمل التالي، فقط استجب بالتنسيق الخاص بالقائمة، لا كلمات أخرى!!!:
[النص]: {input}
[الاستجابة]:
"""
}

QUERY_GENERATION_PROMPT = {
    "system": "أنت مولد استعلامات يقوم بإنشاء استعلامات فعالة وموجزة لمحركات البحث للتحقق من صحة ادعاء معين. يجب أن تكون استجابتك فقط في تنسيق قائمة بايثون (بدون كلمات أخرى!)",
    "user": """أنت مولد استعلامات صُمم لمساعدة المستخدمين على التحقق من صحة ادعاء معين باستخدام محركات البحث. مهمتك الأساسية هي إنشاء قائمة بايثون تحتوي على استعلامين فعالين ومشككين لمحركات البحث. يجب أن تساعد هذه الاستعلامات المستخدمين في تقييم واقعية الادعاء المقدم بشكل نقدي باستخدام محركات البحث.
يجب أن ترد فقط بالتنسيق الموضح أدناه (قائمة بايثون للاستعلامات). يرجى الالتزام بالتنسيق بدقة. لا ترد بأي شيء آخر. ابدأ استجابتك بـ '['.
[تنسيق الاستجابة]: ['استعلام1', 'استعلام2']

إليك ثلاثة أمثلة:
الادعاء: الرئيس التنفيذي لتويتر هو بيل غيتس.
الاستجابة: ["من هو الرئيس التنفيذي لتويتر؟", "الرئيس التنفيذي تويتر"]

الادعاء: مايكل فيلبس هو الأولمبي الأكثر تحقيقاً للميداليات على الإطلاق.
الاستجابة: ["من هو الأولمبي الأكثر تحقيقاً للميداليات على الإطلاق؟", "مايكل فيلبس"]

الادعاء: تم إنشاء ChatGPT بواسطة جوجل.
الاستجابة: ["من أنشأ ChatGPT؟", "ChatGPT"]

الآن أكمل التالي (استجب فقط بصيغة قائمة بايثون، لا ترد بكلمات أخرى!!! ابدأ استجابتك بـ '[' وانته بـ ']'):
الادعاء: {input}
الاستجابة: 
"""
}

VERIFICATION_PROMPT = {
    "system": "أنت مساعد بارع.",
    "user": """تم إعطاؤك قطعة من النص. مهمتك هي تحديد ما إذا كان هناك أي أخطاء واقعية داخل النص.
عند الحكم على واقعية النص المقدم، يمكنك الرجوع إلى الأدلة المقدمة إذا لزم الأمر. قد تكون الأدلة المقدمة مفيدة. قد تتعارض بعض الأدلة مع بعضها البعض. يجب أن تكون حذرًا عند استخدام الأدلة للحكم على واقعية النص المقدم.
يجب أن تكون الاستجابة قاموسًا يحتوي على أربعة مفاتيح - "reasoning" (التفسير)، "factuality" (الواقعية)، "error" (الخطأ)، و"correction" (التصحيح) - والتي تتوافق مع التفسير، ما إذا كان النص المقدم واقعيًا أم لا (Boolean - True أو False)، الخطأ الواقعي الموجود في النص، والنص المصحح.
التالي هو النص المقدم
[النص]: {claim}
التالي هو الأدلة المقدمة
[الأدلة]: {evidence}
يجب أن ترد فقط بالتنسيق الموضح أدناه. لا ترد بأي شيء آخر. ابدأ استجابتك بـ '{{'.
[تنسيق الاستجابة]: 
{{
    "reasoning": "لماذا النص المقدم واقعي أو غير واقعي؟ كن حذرًا عند قولك إن شيئًا ما غير واقعي. عندما تقول إن شيئًا ما غير واقعي، يجب أن تقدم أدلة متعددة لدعم قرارك.",
    "error": "اكتب 'None' إذا كان النص واقعيًا؛ وإلا، صف الخطأ.",
    "correction": "النص المصحح إذا كان هناك خطأ.",
    "factuality": True إذا كان النص واقعيًا، False إذا كان غير ذلك.
}}
"""
}

ARABIC_TO_ENGLISH_TRANSLATION_PROMPT = {
    "system": "You are a helpful assistant.",
    "user": """You are given a piece of text in Arabic. Your task is to translate it into English. The translation should be accurate and maintain the original meaning of the text. Please ensure that the translation is grammatically correct and coherent in English.
DO NOT RESPOND WITH ANYTHING ELSE. ADDING ANY OTHER EXTRA NOTES THAT VIOLATE THE RESPONSE FORMAT IS BANNED. 

{input}
""",
}

ENGLISH_TO_ARABIC_TRANSLATION_PROMPT = {
    "system": "You are a helpful assistant.",
    "user": """You are given a piece of text in English. Your task is to translate it into Arabic. The translation should be accurate and maintain the original meaning of the text. Please ensure that the translation is grammatically correct and coherent in Arabic.
DO NOT RESPOND WITH ANYTHING ELSE. ADDING ANY OTHER EXTRA NOTES THAT VIOLATE THE RESPONSE FORMAT IS BANNED.

{input}
""",
}
