"""All prompts used for fact-checking subtasks prompting."""

"""All prompts used for fact-checking subtasks prompting."""

CLAIM_EXTRACTION_PROMPT = {
    "system": "Моля, предоставете твърдението, което искате да проверите.",
    "user": """Даден ви е текст, който съдържа твърдения за знание. Твърдение е изречение, което заявява нещо като вярно или невярно и може да бъде проверено от хора. Вашата задача е точно да идентифицирате и извлечете всяко твърдение, посочено в предоставения текст. След това разрешете всякакви кореференции (местоимения или други изрази, които се отнасят към нещо), за по-голяма яснота. Всяко твърдение трябва да бъде кратко (по-малко от 15 думи) и самостоятелно.
Вашият отговор ТРЯБВА да бъде списък от речници. Всеки речник трябва да съдържа ключа "claim", който съответства на извлеченото твърдение (с всички разрешени кореференции).
ТРЯБВА да отговорите САМО във формата, описан по-долу. НЕ ДОБАВЯЙТЕ НИКАКВИ ДОПЪЛНИТЕЛНИ БЕЛЕЖКИ, КОИТО НАРУШАВАТ ФОРМАТА НА ОТГОВОРА. ЗАПОЧНЕТЕ ОТГОВОРА С '['.
[формат на отговора]: 
[
    {{
    "claim": "Уверете се, че твърдението е под 15 думи и изразява пълна идея. Разрешете всички кореференции (местоимения или други изрази за позоваване) за яснота.",
    }},
    ...
]

Ето два примера:
[текст]: Томаш Бердих победи Гаел Монфис с 6-1, 6-4 в събота. Шестият поставен достига финала на Monte Carlo Masters за първи път. Бердих ще се изправи срещу Рафаел Надал или Новак Джокович на финала.
[отговор]: [{{"claim": "Томаш Бердих победи Гаел Монфис с 6-1, 6-4"}}, {{"claim": "Томаш Бердих победи Гаел Монфис с 6-1, 6-4 в събота"}}, {{"claim": "Томаш Бердих достига финала на Monte Carlo Masters"}}, {{"claim": "Томаш Бердих е шестият поставен"}}, {{"claim": "Томаш Бердих достига финала на Monte Carlo Masters за първи път"}}, {{"claim": "Бердих ще се изправи срещу Рафаел Надал или Новак Джокович"}}, {{"claim": "Бердих ще се изправи срещу Рафаел Надал или Новак Джокович на финала"}}]

[текст]: Tinder показва само последните 34 снимки, но потребителите могат лесно да видят повече. Компанията също така заяви, че е подобрила функцията за общи приятели.
[отговор]: [{{"claim": "Tinder показва само последните снимки"}}, {{"claim": "Tinder показва само последните 34 снимки"}}, {{"claim": "Потребителите на Tinder могат лесно да видят повече снимки"}}, {{"claim": "Tinder заяви, че е подобрил функция"}}, {{"claim": "Tinder заяви, че е подобрил функцията за общи приятели"}}]

Сега завършете следното, ОТГОВАРЯЙТЕ САМО ВЪВ ФОРМАТ НА СПИСЪК, БЕЗ ДРУГИ ДУМИ!!!:
[текст]: {input}
[отговор]: 
"""
}

QUERY_GENERATION_PROMPT = {
    "system": "Ти си генератор на заявки, който създава ефективни и кратки заявки за търсачки, за да провери дадено твърдение. Отговаряш само във формат на списък в Python (БЕЗ ДРУГИ ДУМИ!)",
    "user": """Ти си генератор на заявки, създаден да помага на потребителите да проверяват дадено твърдение чрез търсачки. Основната ти задача е да генерираш списък в Python с две ефективни и критични заявки за търсене. Тези заявки трябва да помогнат на потребителите критично да оценят достоверността на даденото твърдение чрез търсачки.
Трябва да отговаряш само във формата, описан по-долу (списък в Python с заявки). МОЛЯ, СТРИКТНО СПАЗВАЙ ФОРМАТА. НЕ ВРЪЩАЙ НИЩО ДРУГО. ЗАПОЧНИ ОТГОВОРА С '['.
[формат на отговора]: ['query1', 'query2']

Ето три примера:
твърдение: Главният изпълнителен директор на Twitter е Бил Гейтс.
отговор: ["Кой е главният изпълнителен директор на Twitter?", "CEO Twitter"]

твърдение: Майкъл Фелпс е най-награждаваният олимпиец на всички времена.
отговор: ["Кой е най-награждаваният олимпиец на всички времена?", "Michael Phelps"]

твърдение: ChatGPT е създаден от Google.
отговор: ["Кой е създал ChatGPT?", "ChatGPT"]

Сега завърши следното (ОТГОВАРЯЙ САМО ВЪВ ФОРМАТ НА СПИСЪК, НЕ ВРЪЩАЙ ДРУГИ ДУМИ!!! ЗАПОЧНИ ОТГОВОРА С '[' И ГО ЗАВЪРШИ С ']'):
твърдение: {input}
отговор: 
"""
}

VERIFICATION_PROMPT = {
    "system": "Ти си блестящ асистент.",
    "user": """Даден ти е текст. Твоята задача е да определиш дали в текста има фактически грешки.
Когато оценяваш достоверността на дадения текст, можеш да се позоваваш на предоставените доказателства, ако е необходимо. Предоставените доказателства могат да бъдат полезни. Някои доказателства може да си противоречат. Трябва да бъдеш внимателен, когато ги използваш, за да прецениш достоверността на текста.
Отговорът трябва да бъде речник с четири ключа — "reasoning", "factuality", "error" и "correction", които съответстват на разсъжденията, дали текстът е фактически верен (Булева стойност — True или False), на фактическата грешка, ако има такава, и на коригирания текст.
Следното е даденият текст
[текст]: {claim}
Следното са предоставените доказателства
[доказателства]: {evidence}
Трябва да отговориш само във формата, описан по-долу. НЕ ВРЪЩАЙ НИЩО ДРУГО. ЗАПОЧНИ ОТГОВОРА С '{{'.
[формат на отговора]: 
{{
    "reasoning": "Защо даденият текст е фактически верен или неверен? Бъди внимателен, когато твърдиш, че нещо е невярно. Когато твърдиш, че нещо е невярно, трябва да предоставиш няколко доказателства в подкрепа на решението си.",
    "error": "None, ако текстът е фактически верен; в противен случай опиши грешката.",
    "correction": "Коригираният текст, ако има грешка.",
    "factuality": True, ако текстът е фактически верен, False в противен случай.
}}
"""
}


BULGARIAN_TO_ENGLISH_TRANSLATION_PROMPT = {
    "system": "You are a helpful assistant.",
    "user": """You are given a piece of text in Bulgarian. Your task is to translate it into English. The translation should be accurate and maintain the original meaning of the text. Please ensure that the translation is grammatically correct and coherent in English.
DO NOT RESPOND WITH ANYTHING ELSE. ADDING ANY OTHER EXTRA NOTES THAT VIOLATE THE RESPONSE FORMAT IS BANNED. 

{input}
""",
}

ENGLISH_TO_BULGARIAN_TRANSLATION_PROMPT = {
    "system": "You are a helpful assistant.",
    "user": """You are given a piece of text in English. Your task is to translate it into Bulgarian. The translation should be accurate and maintain the original meaning of the text. Please ensure that the translation is grammatically correct and coherent in Bulgarian.
DO NOT RESPOND WITH ANYTHING ELSE. ADDING ANY OTHER EXTRA NOTES THAT VIOLATE THE RESPONSE FORMAT IS BANNED.

{input}
""",
}
